ЖКХ/src/DataProcessors/ЗагрузкаВыставленныхСчетов/ЗагрузкаВыставленныхСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаВыставленныхСчетов</name>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

ЖКХ/src/Documents/ВыставленныеСчета/ВыставленныеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыставленныеСчета</name>
  <registerRecords>AccumulationRegister.ПотреблениеРесурсов</registerRecords>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.ЛицевыеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недвижимость</name>
    <type>
      <types>CatalogRef.ОбъектыНедвижимости</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перерасчеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Задолженность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Льготы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖКХ/src/DataProcessors/ЗагрузкаВыставленныхСчетов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьФайл(Команда)

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл с выставленными счетами'");
	ПараметрыДиалога.Фильтр = НСтр("ru = 'Файлы CSV (*.csv)|*.csv|Все файлы (*.*)|*.*'");
	ПараметрыДиалога.МножественныйВыбор = Ложь;

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтотОбъект);

	НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершении, , , , ПараметрыДиалога,
		УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите лицевой счет.'"));
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(АдресФайла) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите файл для загрузки.'"));
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
	ПоказатьВопрос(Оповещение,
		НСтр("ru = 'Создать документы по данным файла?'"),
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеПомещенияФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено
		ИЛИ ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;

	АдресФайла = ОписаниеПомещенногоФайла.Адрес;
	Объект.ИмяФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ЗагрузитьНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()

	Попытка
		Данные = ПрочитатьДанныеФайла(АдресФайла);

		Если Данные.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Файл не содержит данных.'");
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;

		СозданныеДокументы = СоздатьДокументы(Данные);

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
			НСтр("ru = 'Создано документов: %1 (строк: %2).'"),
			СозданныеДокументы.Количество(), Данные.Количество());
		Сообщение.Сообщить();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр("ru = 'Ошибка загрузки: %1'"), ОписаниеОшибки());
		Сообщение.Сообщить();
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПрочитатьДанныеФайла(АдресФайла)

	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("Услуга", Новый ОписаниеТипов("Строка"));
	Данные.Колонки.Добавить("Объем", Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Тариф", Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Начислено", Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Пени", Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Перерасчеты", Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Задолженность", Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Льготы", Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Оплачено", Новый ОписаниеТипов("Число"));

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные);
	Чтение = Новый ЧтениеТекста(Новый ПотокВПамяти(Буфер), КодировкаТекста.UTF8);

	// Первая строка файла - заголовок, пропускаем ее.
	Строка = Чтение.ПрочитатьСтроку();
	Строка = Чтение.ПрочитатьСтроку();

	Пока Строка <> Неопределено Цикл
		Если НЕ ПустаяСтрока(СтрЗаменить(Строка, ";", "")) Тогда
			ДобавитьСтрокуДанных(Данные, Строка);
		КонецЕсли;
		Строка = Чтение.ПрочитатьСтроку();
	КонецЦикла;

	Возврат Данные;

КонецФункции

&НаСервере
Процедура ДобавитьСтрокуДанных(Данные, Строка)

	Части = СтрРазделить(Строка, ";", Ложь);

	Если Части.Количество() < 10 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Некорректная строка файла: ""%1"".'"), Строка);
	КонецЕсли;

	НоваяСтрока = Данные.Добавить();
	НоваяСтрока.Период = РазобратьДату(Части[0]);
	НоваяСтрока.Услуга = СокрЛП(Части[1]);
	НоваяСтрока.Объем = РазобратьЧисло(Части[2]);
	НоваяСтрока.Тариф = РазобратьЧисло(Части[3]);
	НоваяСтрока.Начислено = РазобратьЧисло(Части[4]);
	НоваяСтрока.Пени = РазобратьЧисло(Части[5]);
	НоваяСтрока.Перерасчеты = РазобратьЧисло(Части[6]);
	НоваяСтрока.Задолженность = РазобратьЧисло(Части[7]);
	НоваяСтрока.Льготы = РазобратьЧисло(Части[8]);
	НоваяСтрока.Оплачено = РазобратьЧисло(Части[9]);

	// Если объем не указан, восстанавливаем его из начисления: Начислено = Объем * Тариф.
	Если НоваяСтрока.Объем = 0 И НоваяСтрока.Тариф <> 0 Тогда
		НоваяСтрока.Объем = НоваяСтрока.Начислено / НоваяСтрока.Тариф;
	КонецЕсли;

КонецПроцедуры

// Создает по одному документу на каждый месяц, представленный в данных.
//
// Параметры:
//  Данные - ТаблицаЗначений - прочитанные строки файла.
//
// Возвращаемое значение:
//  Массив из ДокументСсылка.ВыставленныеСчета - созданные документы.
//
&НаСервере
Функция СоздатьДокументы(Данные)

	УслугиПоНаименованию = УслугиПоНаименованию();

	СтрокиПоМесяцам = Новый Соответствие;
	Для Каждого СтрокаДанных Из Данные Цикл
		Месяц = НачалоМесяца(СтрокаДанных.Период);
		СтрокиМесяца = СтрокиПоМесяцам[Месяц];
		Если СтрокиМесяца = Неопределено Тогда
			СтрокиМесяца = Новый Массив;
			СтрокиПоМесяцам.Вставить(Месяц, СтрокиМесяца);
		КонецЕсли;
		СтрокиМесяца.Добавить(СтрокаДанных);
	КонецЦикла;

	СозданныеДокументы = Новый Массив;
	СозданныеМесяцы = Новый Соответствие;
	Для Каждого СтрокаДанных Из Данные Цикл
		Месяц = НачалоМесяца(СтрокаДанных.Период);
		Если СозданныеМесяцы[Месяц] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СозданныеМесяцы.Вставить(Месяц, Истина);
		СозданныеДокументы.Добавить(СоздатьДокумент(Месяц, СтрокиПоМесяцам[Месяц], УслугиПоНаименованию));
	КонецЦикла;

	Возврат СозданныеДокументы;

КонецФункции

// Создает и записывает документ за указанный месяц.
//
// Параметры:
//  Месяц - Дата - начало месяца.
//  СтрокиДанных - Массив из СтрокаТаблицыЗначений - строки файла за месяц.
//  УслугиПоНаименованию - Соответствие из КлючИЗначение - соответствие "наименование услуги - ссылка".
//
// Возвращаемое значение:
//  ДокументСсылка.ВыставленныеСчета - созданный документ.
//
&НаСервере
Функция СоздатьДокумент(Месяц, СтрокиДанных, УслугиПоНаименованию)

	Документ = Документы.ВыставленныеСчета.СоздатьДокумент();
	Документ.Дата = Месяц;
	Документ.ЛицевойСчет = Объект.ЛицевойСчет;

	Для Каждого СтрокаДанных Из СтрокиДанных Цикл

		СтрокаУслуги = Документ.Услуги.Добавить();
		// Если услуга не найдена по наименованию, реквизит остается пустым.
		СтрокаУслуги.Услуга = УслугиПоНаименованию[СтрокаДанных.Услуга];
		СтрокаУслуги.Объем = СтрокаДанных.Объем;
		СтрокаУслуги.Тариф = СтрокаДанных.Тариф;
		СтрокаУслуги.Начислено = СтрокаДанных.Начислено;
		СтрокаУслуги.Пени = СтрокаДанных.Пени;
		СтрокаУслуги.Перерасчеты = СтрокаДанных.Перерасчеты;
		СтрокаУслуги.Задолженность = СтрокаДанных.Задолженность;
		СтрокаУслуги.Льготы = СтрокаДанных.Льготы;
		СтрокаУслуги.Оплачено = СтрокаДанных.Оплачено;

	КонецЦикла;

	Документ.Записать();

	Возврат Документ;

КонецФункции

&НаСервере
Функция УслугиПоНаименованию()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыРесурсов.Ссылка КАК Услуга,
	|	ВидыРесурсов.Наименование КАК Наименование
	|ИЗ
	|	ПланВидовХарактеристик.ВидыРесурсов КАК ВидыРесурсов";

	Результат = Новый Соответствие;
	Для Каждого СтрокаРезультата Из Запрос.Выполнить().Выгрузить() Цикл
		Результат.Вставить(СокрЛП(СтрокаРезультата.Наименование), СтрокаРезультата.Услуга);
	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаСервере
Функция РазобратьЧисло(Значение)
	
	Значение = СокрЛП(Строка(Значение));
	Если ПустаяСтрока(Значение) Тогда
		Возврат 0;
	КонецЕсли;
	
	Значение = СтрЗаменить(Значение, ",", ".");
	
	ДопустимыеСимволы = "0123456789-.";
	ОчищенноеЗначение = "";
	Для Индекс = 1 По СтрДлина(Значение) Цикл
		СимволЗначения = Сред(Значение, Индекс, 1);
		Если СтрНайти(ДопустимыеСимволы, СимволЗначения) > 0 Тогда
			ОчищенноеЗначение = ОчищенноеЗначение + СимволЗначения;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ОчищенноеЗначение) Тогда
		Возврат 0;
	КонецЕсли;
	
	Попытка
		Возврат Число(ОчищенноеЗначение);
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция РазобратьДату(Значение)

	Значение = СокрЛП(Значение);
	Части = СтрРазделить(Значение, ".");

	Если Части.Количество() <> 3 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Некорректная дата: ""%1"".'"), Значение);
	КонецЕсли;

	Возврат Дата(Число(Части[2]), Число(Части[1]), Число(Части[0]));

КонецФункции

#КонецОбласти
